# dict(1='one', 2='two', 3='three')
dict(you='ты', we='мы', they='они', us='нам')
# {house:'дом', test:'экзамен', crow:'толпа'}
dict()
{"river": "река", 'road': 'Дорога', 'one': 1}
dict([[1, 'one'], [2, 'two'], [3, 'three']])
# dict('you'='ты', 'we'='мы', 'they'='они', 'us'='нам')
# {house='дом', test='экзамен', crowd='толпа'}
# dict('1'='one', '2'='two', '3'='three')
{}

d = {}
d[5.6] = 5.6
d["house"] = ['дом', 'жилище', 'хижина']
# d[[1, 2, 3]] = 123
d['dict'] = {'one': 1, 'two': 2}
d[True] = 'истина'
# d[[True]] = 'истина'
d[1] = 'one'
# print(d)

###########################################################
# # прочитать строку с этими данными и на их основе сформировать словарь d, используя функцию dict()
# s = 'one=1 two=2 three=3'

# d = dict([[int(x) if x.isdigit() else x for x in st.split(sep='=')] for st in s.split()])
# print(*sorted(d.items()))

# s = '''5=отлично
# 4=хорошо
# 3=удовлетворительно'''

# import sys
# lst_in = list(map(str.strip, s.split(sep='\n')))

# d = {}

# for l in lst_in :
#     d[int(l[0])] = l[2:]

# print(*sorted(d.items()))

###########################################################
# # Необходимо ее раскодировать, используя азбуку Морзе из предыдущего занятия. Все буквы в строке должны быть малыми (нижний регистр). Полученное сообщение (строку) вывести на экран.

# chars = {"А": ".-", "Б": "-...", "В": ".--","Г": "--.", "Д": "-..", "Е": ".",
#          "Ж": "...-", "З": "--..", "И": "..", "Й": ".---", "К": "-.-", "Л": ".-..",
#          "М": "--", "Н": "-.", "О": "---", "П": ".--.", "Р": ".-.", "С": "...",
#          "Т": "-", "У": "..-", "Ф": "..-.", "Х": "....", "Ц": "-.-.", "Ч": "---.",
#          "Ш": "----", "Щ": "--.-", "Ъ": "--.--", "Ы": "-.--", "Ь": "-..-", 
#          "Э": "..-..", "Ю": "..--", "Я": ".-.-", " ": "-...-"}

# chars_rev = {}
# for key, value in chars.items() :
#     chars_rev[value] = key

# print(chars_rev)

###########################################################
# ''' На основе списка lst_in сформировать словарь, где ключи - дни рождения (целое число), а значения - имена (строка). Выведите полученный словарь в формате (см. пример ниже):

# день рождения 1: имя1, ..., имяN1
# день рождения 2: имя1, ..., имяN2
# ...
# день рождения M: имя1, ..., имяNM '''

# lst = '''3 Сергей
# 5 Николай
# 4 Елена
# 7 Владимир
# 5 Юлия
# 4 Светлана'''


# lst = '''3 Сергей
# 5 Светлана
# 4 Елена
# 7 Владимир
# 5 Юлия
# 4 Светлана
# 11 Николай
# 5 Михаил'''

# # считывание списка 
# lst_in = list(map(str.strip, lst.split(sep='\n')))
# # здесь продолжайте программу (используйте список lst_in)
# d = {}

# for set in lst_in :
#     line = set.split()
#     if int(line[0]) in d :
#         d[int(line[0])] += [line[1]]
#     else:
#         d[int(line[0])] = [line[1]]

# for day, name in d.items() :
#     print(f'{day}: ', end='')
#     print(*name, sep=', ')

###########################################################
# Все предметы даны в единственном экземпляре. Выведите список предметов (в строчку через пробел), которые берет с собой Сергей в порядке убывания их веса.
things = {'карандаш': 20, 'зеркальце': 100, 'зонт': 500, 'рубашка': 300, 
          'брюки': 1000, 'бумага': 200, 'молоток': 600, 'пила': 400, 'удочка': 1200,
          'расческа': 40, 'котелок': 820, 'палатка': 5240, 'брезент': 2130, 'спички': 10}
things_1 = dict([y, x] for x, y in things.items())
things_1 = dict(sorted(things_1.items(), reverse=True))
print(things_1)

max_weight = int(input('Введите максимальный вес (кг): ')) * 1000

for w in things_1 :
    if (max_weight - w) < 0 :
        continue
    max_weight -= w
    print(things_1[w], end=' ')

t = 1, 2, 3
d = dict.fromkeys(t)
print(d, len(d))